import React from 'react';

const qoutes = [
    {
        qoute: "أحتاج إلى الشعور بالرضا: طاقة المدينة وهدوء البلاد.",
        name: "شارلوت كاسيراغي"
    },
    {
        qoute: "إن عدم المبالاة يكون في بعض الاحيان وفي بعض الأمور هو ما كل تكلفنا به الطاقة البشرية من المبالاة",
        name: "مصطفى صادق الرافعي"
    },
    {
        qoute: "احلامنا ومشاعرنا التي تتغلغل في قلوبنا هي مفاتيح سحرية يمكنها أن تحرر الكثير الكثير من الطاقة والقوة.",
        name: "جون سي ماكسويل"
    },
    {
        qoute: "التمني يستهلك نفس الطاقة التي يستهلكها التخطيط.",
        name: "اليانور روزفلت"
    },
    {
        qoute: "الدموع مثلها مثل الطاقة لا تفنى ولا تستحدث فالحزن في العالم أيضا له كمية ثابتة تتكرر بأشكال مختلفة ومملة.",
        name: "حسين البرغوثي"
    },
    {
        qoute: "الطاقة التي ينبغي أن تنفق لانجاز الفعل ، تُستهلك في قول الفعل",
        name: "إبراهيم الكوني"
    },
    {
        qoute: "الطاقة والمثابرة يقهران كل شيء.",
        name: "بنجامين فرانكلين"
    },
    {
        qoute: "اِن طاقة الاٍنسان لمحدودة و لكنه ليس عاجزاً كل العجز",
        name: "إبراهيم عبد القادر المازني"
    },
    {
        qoute: "ان كل كلمة و كل فكرة تعد بمثابة طاقة روحية تقوم بتنشيط قوى الحياة في داخلك ، سواء كانت ذات طبيعة سلبية أو ايجابية",
        name: "إبراهيم الفقي"
    },
    {
        qoute: "اينما ركزت الانتباه تدفقت الطاقة و ظهرت النتيجة",
        name: "إبراهيم الفقي"
    },
    {
        qoute: "سوف يتغير التاريخ فقط متى استطعنا استخدام طاقة الحب، تماما كما نستخدم طاقة الريح والبحار والذرة",
        name: "باولو كويلو"
    },
    {
        qoute: "كل من ألقت الأقدار على منكبيه وزراً لا طاقة للناس به يبدو في نظر الناس مكابراً",
        name: "إبراهيم الكوني"
    },
    {
        qoute: "كلما زاد العناء زادت الطاقة للاستمرار في الساقية",
        name: "نيكانور بارا"
    },
    {
        qoute: "مع الزمن أصبح من السهل تزييف البسمات .. الضحك يتطلب طاقة أكبر و بذا يصعب تزييفه",
        name: "أحمد مستجير"
    },
    {
        qoute: "هل تذكر الأشياء التي كانت مثيرة للقلق قبل نحو سنة؟ كيف هي اليوم؟ ألم تضيع الكثير من الطاقة غير المثمرة لاجلها؟ ألم يتم تصحيح معظمها؟",
        name: "ديل كارنيجي"
    }
];

function random(){
    return qoutes[Math.floor(Math.random() * qoutes.length)];
}

const Qoutes = () => {
    const { qoute, name } = random();
    
    return (
        <div className="card status make-me-sticky">
            <div className="card-body">
                <h3>{qoute}</h3>
                <p>{name}</p>
            </div>
        </div>
    );
}

export default Qoutes;
